## staging: cloudwatch_alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.metrics_app_errors_500_qr_parse_above_critical_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_app_errors_500_qr_parse_above_critical_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-critical",
        ]
      + alarm_description                     = "This metric monitors error-500-qr-parse errors in the covid alert app"
      + alarm_name                            = "metrics-app-errors-500-qr-parse-above-critical-threshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Identifier" = "error-500-qr-parse"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "CovidAlertApp"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.metrics_app_errors_500_qr_parse_above_warning_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_app_errors_500_qr_parse_above_warning_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "This metric monitors error-500-qr-parse errors in the covid alert app"
      + alarm_name                            = "metrics-app-errors-500-qr-parse-above-warning-threshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Identifier" = "error-500-qr-parse"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "CovidAlertApp"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>